{
  "comments": "//all variables in this file containing (Comment) are comments on the variable below and do not need to be initiated",
  "runModeComment": "//0 for PCA+data correction; 1 for data correction alone",
  "runMode": 1,
  "expFileComment": "MANDATORY; e.g.: /root/diretory/expression.txt; //expression file on which the PCA should be conducted",
  "expFile": "TestCaseFiles/PCcorrection/eigenvectors/TESTexpression.txt",
  "chromLocationsFileComment": "OPTIONAL; e.g.: /root/diretory/chromosomes.txt; //file describing the locations of chromosomes (used to sort the genes based on chromosome). Should have the following format: geneID\tchromosome\tstart\tend",
  "chromLocationsFile": "TestCaseFiles/PCcorrection/eigenvectors/GenePositionInfo_Chr21Only.txt",
  "writeFolderComment": "OPTIONAL; e.g.: /root/diretory/pcaResults/; //folder where all output should be written (default: removeExtention(expFile)+/)",
  "writeFolder": "TestCaseFiles/PCcorrection/eigenvectors/",
  "removeGeneComment": "OPTIONAL; e.g.: ENSG00000001460; //Name of a gene you wish to remove for any reason",
  "removeGene": null,
  "genesToIncludeComment": "OPTIONAL; e.g.: /root/diretory/includeGenes.txt; //A file containing a list of genes you wish to include. Any genes not in this file are excluded. Should have gene names in a column (first column). First row is excluded (header)",
  "genesToInclude": null,
  "isPcaOverGenesComment": "//true for PCA over genes, false for PCA over samples",
  "isPcaOverGenes": true,
  "correlationComment": "//true for correlation, false for covariance",
  "correlation": false,
  "setLowestToAverageComment": "//true sets all the lowest values in a sample to the average, effectively this means any gene that has an expression of does not contribute to the covariance or correlation",
  "setLowestToAverage": false,
  "centerGenesComment": "//true centers the expression for the genes (sets average to 0); should be used when conducting PCA over genes. If PCA over genes, use centerSamples\u003dfalse",
  "centerGenes": true,
  "centerSamplesComment": "//true centers expression over the samples (sets average to 0); should be used when conducting PCA over samples. Centering over samples happens after centering over genes. If PCA over samples, reccommended to also use centerGenes\u003dtrue",
  "centerSamples": false,
  "writeAllComment": "//true writes all intermediate files, which can be large files",
  "writeAll": true,
  "log2Comment": "//true for logging the data before conducting the PCA",
  "log2": true,
  "addLogValComment": "//Value to add before taking the logaritm when logging data (if \u003clog2\u003e\u003d\u003dtrue) before conducting the PCA. Should be larger than 0",
  "addLogVal": 0.5,
  "quantileNormComment": "//true for quantile normalization of the data before the PCA",
  "quantileNorm": false,
  "zScoresComment": "//true for calculating Z-scores from the PCscores stored in a separate matrix. Can be time consuming.",
  "zScores": false,
  "deSeqNormComment": "//true for DESeq normalization of the data before the PCA",
  "deSeqNorm": true,
  "minSamplesExpressedComment": "//if -1, this will include all genes. Otherwise will exclude any gene that is expressed in less then this number of samples (and those that have no variance) any gene that has an expression lower then \u003cminExpression\u003e is considered as not expressed",
  "minSamplesExpressed": -1,
  "minExpressionComment": "//if -1 does nothing. Otherwise sets the cutoff for minSamplesExpressed; see \u003cminSamplesExpressed\u003e",
  "minExpression": -1,
  "correctTotalReadCountComment": "//if \u003c\u003d0 does nothing. Otherwise corrects for total read count in a sample, setting the new total read count to this number (use 1000000 to obtain TPM values (not corrected for gene lenght though))",
  "correctTotalReadCount": -1.0,
  "duplicateCutoffComment": "//if 1 does nothing. Samples with a correlation above this value are removed (only samples next to each in the matrix are removed, as this is usually the case for replicates, which we aim to remove like this, but not others)",
  "duplicateCutoff": 1.0,
  "highestExpressedComment": "//1 for all genes to be included, 0.5 \u003d 50% highest expressed genes only (removes 50% lowest expressed genes (after quantile normalization if quantile normalization is used (then re-normalizes)))",
  "highestExpressed": 1.0,
  "spearmanComment": "//if -1 does not use spearman rank correlation. if 0, uses spearman rank correlation, if \u003e0, it sets all values below this value to 0 (under the notion that these values are below the detection limit)",
  "spearman": -1.0,
  "correlationScriptComment": "MANDATORY; e.g. /root/directory/Jar/CorrelationLarge.jar //location of the script used to calculate correlation/covariance, called from command line using: .)",
  "correlationScript": "/Volumes/Promise_RAID/sipko/Jar/CorrelationLarge.jar",
  "sampleFileComment": "Optional; e.g. /root/directory/filesToCorrect.txt//Filename of the file containing the samples for which the expression should be corrected",
  "sampleFile": "TestCaseFiles/PCcorrection/eigenvectors/TESTexpression.txt",
  "chr21FNComment": "Optional; e.g. /root/directory/chr21.txt //File containing the genes on chromosome 21 (in first column). This is used to calculate the significance of the expression difference of the genes on chr21 before and after data correction (used to test on down syndrome samples)",
  "chr21FN": "TestCaseFiles/PCcorrection/eigenvectors/GenePositionInfo_Chr21Only.txt",
  "PCsComment": "Optional; e.g. 1,4,7-10  //Princial components to correct for function takes format like: 1,4,5-10 or 3-10",
  "PCs": "1-33",
  "writeFolderCorrectedComment": "Optional; e.g. /root/directory/corrected/  //folder where the files corrected for principal components should be written (default\u003dremoveExtention(sample.getName())+/",
  "writeFolderCorrected": "",
  "avgStdevFolderComment": "Optional; e.g. /root/directory/PCAresults/  //this is the folder with the files for the z-score calculations containing the averages and standard deviations to be used for this. allows z-scores to be calculated using the BBMRI averages and stdevs",
  "avgStdevFolder": null,
  "optimalPCremovalComment": "//the number of samples in which the PC has to be bad (decreasing the difference between genes on chr21 and the other genes), in order for it not to be removed",
  "optimalPCremoval": -1,
  "className": "PCA.PCApipeline",
  "startTime": "2017-03-24 21:41:02",
  "executor": "file:/C:/Users/Sipko/git/PCrotation/Sipko/target/classes/",
  "runTime": "Not finished",
  "jsonFN": "TestCaseFiles/PCcorrection/eigenvectors/config.json"
}
